Bachelor Thesis/3D.00/q9.501/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.01;

boundaryField
{
   
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            zeroGradient;  
    }

    atmosphere
    {
        type            zeroGradient;
    }

	riverSlope_riverSlope
	{
        		type            nutSpalartAllmarasWallFunction;
        		Cmu             0.09;
        		kappa           0.41;
        		E               9.8;
        		Cs              uniform 0.5;
        		Ks              uniform 0.001;
        		value           uniform 0.01; 
	}


	left
	{
        type            zeroGradient;
	}


	right
	{
        type            zeroGradient;
	}
}

// ************************************************************************* //
