Bachelor Thesis/3D.00/q9.501/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
	default         Gauss linear;
	grad(U) 	Gauss linear;
	grad(alpha1) 	Gauss linear;
}

divSchemes
{
    div(rho*phi,U)  	Gauss limitedLinearV 1;
    div(phi,alpha)  	Gauss upwind;
    div(phirb,alpha) 	Gauss interfaceCompression;
    div(phi,k)      	Gauss upwind;
    div(phi,omega) 	Gauss upwind;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
    interpolate(HbyA) linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    pd;
    pcorr;
    alpha1;
}

// ************************************************************************* //
